13/data/attachments/4382651786614d18.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4909b0cb-4ed9-47b7-8161-21da3fcc2c7d</nif:username>
            <nif:friendToBeAdded>Mary_stay_Friend_99460_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>